# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живу
import room_1 as r1
import room_2 as r2

for mans in r1.folks:
    print(mans)
for mans in r2.folks:
    print(mans)


